/*课前知识点补充*/ 
/*伪代码是一种算法描述语言。使用伪代码的目的是使被描述的
算法可以容易地以任何一种编程语言实现。因此，伪代码必须结
构清晰、代码简单、可读性好，并且类似自然语言。介于自然语
言与编程语言之间。以编程语言的书写形式指明算法职能。使用
伪代码，不用拘泥于具体实现。*/

/*p58 t11*/
/*通过分析如下矩阵的分布规律，编程自动形成并输出该矩阵。*/
/*                            第一步 如何输出 
/* 1 2 3 4 5                  1
   1 1 6 7 8				  1 1
   1 1 1 9 10                 1 1 1
   1 1 1 1 11                 1 1 1 1
   1 1 1 1 1                  1 1 1 1 1                 

  如何输出 
   1 2 3 4 5   
   1 1 6 7 8  
   1 1 1 9 10 
   1 1 1 1 11
   1 1 1 1 1   */

#include <stdio.h> 
int main()
{/*首先考虑要几个变量：要几个变量来控制，几个变量来输出？*/ 
	int num=2,m,n,cnt1=1,cnt2=5;
	for(m=0;m<5;m++ ) {
		for(n=0;n<cnt1;n++ ){
			printf("1 "); 
		} //输出1的部分 
		cnt1++;
		for(n=0;n<cnt2-1;n++){
			printf("%d ",num);
			num++;
		}//输出非1部分 
		cnt2--;
		puts("\n"); 
	}
 } 
 
 
 
 /*p57 t6 */
 /*有一对兔子，出生后第二个月变成一对大兔子，第三个月变成一对老兔子，
 并开始每月生一对小兔子，以此类推，求第十五个月这个兔子窝中兔子对数*/ 
//  月份     1   2   3   4   5   6   7   8   9   10   11   12
// 小兔子    1   0   1   1   2   3   5   8   13  21   34   55
// 大兔子    0   1   0   1   1   2   3   5   8   13   21   34
// 老兔子    0   0   1   1   2   3   5   8   13  21   34   55
//兔子数量   1   1   2   3   5   8   13  21  34  55   89   144

/*斐波那契数，亦称之为斐波那契数列，又称黄金分割数列、费波那西数列、
费波拿契数、费氏数列，指的是这样一个数列：0、1、1、2、3、5、8、13……
在数学上，斐波纳契数列以如下被以递归的方法定义：F0=0，F1=1，Fn=Fn-1+Fn-2，
用文字来说，就是斐波那契数列列由0和1开始，之后的数就由之前的两数相加。*/

#include <stdio.h>
int main()
{
	int a[15],i;
	a[0]=1;
	a[1]=1;
	for(i=2;i<15;i++){
		a[i]=a[i-1]+a[i-2];
	}
	printf("sum=%d",a[14]);//610对兔子 
}

 
/*p58 t12 */
/*编程输入一个n*n矩阵中各元素的值，求出两条对角线上各元素的和*/ 
/*写法一：给定一个确定的n
  写法二：从键盘输入n的值 */
/*该题需要考虑n是奇数还是偶数，奇数的话中间数会被重复记两次*/

#include <stdio.h>
int main()
{
	int N,m,n,sum1=0,sum2=0,sum;
	printf("请输入N的值：\n");
	scanf("%d",&N);
	int num[N][N];//在c99里可以这么做，c90 ANSI C，c99	
	for(m=0;m<N;m++){                                 num[3][3],中心项是num[1][1] 
		for(n=0;n<N;n++){                               //  0,0   0,1   0,2  
			scanf("%d",&num[m][n]);                     //  1,0   1,1   1,2
		}                                               //  2,0   2,1   2,2...
	}//二维数组写入数据
	for(m=0,n=0;m<N;m++,n++){
		sum1=sum1+num[m][n];
	}
	for(m=0,n=N-1;m<N;m++,n--) {
		sum2=sum2+num[m][n];
	}
	if(N%2==0){
		sum=sum1+sum2;
	}
	else{
		sum=sum1+sum2-num[N/2][N/2];
	}
	printf("%d",sum);
} 
 
 
 
 
/*p58 t15 */
/*编写程序，随机产生20个两位正整数，将其中的前10个数字从小到大排序，
后10个数字从大到小排序，然后按每行10个输出这20个数字 */ 

#include <stdio.h> 
#include <stdlib.h>
int main()
{
	int num[20]={0},m,n;//num[20]={0} 
	for(m=0;m<20;m++){
		while(num[m]<10)
			num[m]=rand()%100;//0-99 题目要求10-99
	} 
	for(m=0;m<20;m++){
		printf("%d ",num[m]);
		if(m==9) puts("\n");
	} 
	puts("\n");
	/*给前10个值从小到大排序;
	给后10个值从大到小排序;
	输出这20个值；*/ 
	/*排序 选择 冒泡*/
	for(m=0;m<10;m++) {
		for(n=m;n<10;n++){
			if(num[m]>num[n]){
				int t;
				t=num[m];
				num[m]=num[n];
				num[n]=t;
			}
		}
	}
	for(m=10;m<20;m++) {
		for(n=m;n<20;n++){
			if(num[m]<num[n]){
				int t;
				t=num[m];
				num[m]=num[n];
				num[n]=t;
			}
		}
	}
	for(m=0;m<20;m++) {
	printf("%d ",num[m]);
	if(m==9) puts("\n");
	}
	
}



//输入一行字符，分别统计出其中字母、空格、数字和其他字符的个数。
#include<stdio.h>
int main()
{
	char ch;
	int a=0,b=0,c=0,d=0,e=0;
	while((ch=getchar())!='\n'){
		if(ch>='A'&&ch<='Z')
			a++;
		else if(ch>='a'&&ch<='z')
			b++;
		else if(ch>='0'&&ch<='9')
			c++;
		else if(ch==' ')
			d++;
		else 
			e++;
	}
	printf("大写字母=%d\n小写字母=%d\n\
数字=%d\n空格=%d\n其他字符=%d\n",a,b,c,d,e);
	return 0;
} 
