/*sy5-11*/
/*通过分析如下矩阵的分布规律，编程自动形成并输
出该矩阵。*/
/*                      第一步 如何输出 
   1 2 3 4 5             1
   1 1 6 7 8        	 1 1
   1 1 1 9 10            1 1 1
   1 1 1 1 11            1 1 1 1
   1 1 1 1 1             1 1 1 1 1                 

  如何输出 
   1 2 3 4 5   
   1 1 6 7 8  
   1 1 1 9 10 
   1 1 1 1 11
   1 1 1 1 1   */

#include <stdio.h> 
int main()
{
	int num=2,m,n,cnt1=1,cnt2=5;
	for(m=0;m<5;m++ ) {
		for(n=0;n<cnt1;n++ ){
			printf("1 "); 
		} //输出1的部分 
		cnt1++;
		for(n=0;n<cnt2-1;n++){
			printf("%d ",num);
			num++;
		}//输出非1部分 
		cnt2--;
		puts("\n"); 
	}
 } 
 
